app/controllers/movies_controller.rb

  def index
    @movies = Movie.where(favorite: true)
---
SELECT "movies".* FROM "movies" WHERE "movies"."favorite" = $1  [["favorite", true]]

  def update
    @movie = Movie.find(params[:id])
    if @movie.favorite
      @movie.update(favorite: false)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 241], ["LIMIT", 1]]
UPDATE "movies" SET "favorite" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["favorite", false], ["updated_at", "2020-10-08 21:13:16.533758"], ["id", 250]]