app/controllers/pages_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."favorite" = $1  [["favorite", false]]
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 1]]
INSERT INTO "movies" ("title", "year", "poster", "tipo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "movies".* FROM "movies" ORDER BY "movies"."favorite" DESC
---
  def home
    if params[:query].present?
      @movies = Movie.where(favorite: false)
      @movies.destroy_all
      @data = JSON.parse(fetch_movies(params[:query]))
      if(@data["Response"] != "False")
        @data["Search"].each do |m|
        @movie = Movie.new(title: m["Title"], year: m["Year"], poster: m["Poster"], tipo: m["Type"])
        @movie.save
        end
      end
    end
    @movies = Movie.all.order(favorite: :desc)